[M_IrisDL3_MySkag MissionDefinition]
MissionName="My wife cheated"
MissionDescription="Some Jarax hire him to find a man they think has turned into a shell. Sikh people [place]pull over[-place], You can see him with a red scarf around his neck.."
TurnInDescription="Hi my love."
MissionSummary="Find Julio and get out."
MissionGiver="Salary distortion"
MissionTurnInLocation="Rewards Dashboard Resource"
TeaserText="great love."

[M_IrisDL3_MySkag:Den1 MissionObjectiveDefinition]
ProgressMessage="First get the output:"

[M_IrisDL3_MySkag:Den2 MissionObjectiveDefinition]
ProgressMessage="Finish the second hole"

[M_IrisDL3_MySkag:Den3 MissionObjectiveDefinition]
ProgressMessage="in last place"

[M_IrisDL3_MySkag:FindHusband MissionObjectiveDefinition]
ProgressMessage="Find Jerek's man"

[M_IrisDL3_MySkag:HuntHusband MissionObjectiveDefinition]
ProgressMessage="See Uriah."

[M_IrisDL3_MySkag:KillHusband MissionObjectiveDefinition]
ProgressMessage="kill a virgin"

[M_IrisDL3_MySkag:MissionObjectiveSetBranchingDefinition_0 MissionObjectiveSetBranchingDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Jarek calls out to find his husband, who turns him into a tree..<br><br>Jericho's unfaithful husband Uriah is not. He fled after getting the money. The Inquisitor promised that you will either give your sword to Jericho so he will believe you killed him, or you will kill the Inquisitor and take him prisoner..<br><br>Yuri will of course choose the first option, but it's up to you."

[M_IrisDL3_MySkag:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisDL3_MySkag:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisDL3_MySkag:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Jerrick is hired to find a religious wife..<br><br>Get a lot of skag. [place]Iron fence[-place], But the red scarf was nobody. Jerrick asks you to kill any bad guys in the area if they are perverts.."

[M_IrisDL3_MySkag:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisDL3_MySkag:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisDL3_MySkag:MissionObjectiveSetDefinition_5 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_IrisDL3_MySkag:ReachDen MissionObjectiveDefinition]
ProgressMessage="Get the basics"

[M_IrisDL3_MySkag:TalkToUriah MissionObjectiveDefinition]
ProgressMessage="Talk to Riya"

[M_IrisDL3_MySkag:TrickWife MissionObjectiveDefinition]
ProgressMessage="Yes, Jack"

